[
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "BBC News",
        "title": "US energy secretary quits amid Trump probe",
        "description": "President Donald Trump confirms the former Texas governor will depart his administration.",
        "url": "http://www.bbc.co.uk/news/world-us-canada-50090538",
        "urlToImage": "news1",
        "publishedAt": "2019-10-17T22:24:11Z",
        "content": "Image copyrightGetty Images\r\nUS Secretary of Energy Rick Perry, who has been drawn into the Trump impeachment inquiry, will resign.\r\nPresident Donald Trump has confirmed the former Texas governor will depart his administration.\r\nMr Perry's exit had been rumou… [+470 chars]"
    },
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "BBC News",
        "title": "A Canadian election looms - six charts explain all",
        "description": "Climate change, gender balance and Quebec - the issues facing Canadians this election.",
        "url": "http://www.bbc.co.uk/news/world-us-canada-50003913",
        "urlToImage": "news2",
        "publishedAt": "2019-10-17T20:05:03Z",
        "content": "Image copyrightGetty Images\r\nCanadians go to the polls on 21 October, four years after Justin Trudeau's Liberal Party swept to power.\r\nBut things aren't as clear-cut this time around, with several other parties rising in the polls.\r\nHere's a visual look at so… [+4215 chars]"
    },
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "BBC News",
        "title": "Turkey to suspend Syria offensive, US says",
        "description": "Turkey agrees to pause operation in northern Syria to let Kurdish-led forces withdraw - US Vice-President Mike Pence",
        "url": "http://www.bbc.co.uk/news/world-middle-east-50091305",
        "urlToImage": "news3",
        "publishedAt": "2019-10-17T17:46:50Z",
        "content": "Turkey has agreed to a ceasefire in northern Syria to let Kurdish-led forces withdraw, US Vice President Mike Pence has announced.\r\nAll military operations will be paused for 120 hours, and the US will help facilitate an \"orderly withdrawal\" of Kurdish-led tr… [+345 chars]"
    },
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "BBC News",
        "title": "Johnson 'very confident' MPs will back deal",
        "description": "The PM is facing an uphill battle to get his new Brexit deal through the House of Commons on Saturday.",
        "url": "http://www.bbc.co.uk/news/uk-politics-50090636",
        "urlToImage": "news4",
        "publishedAt": "2019-10-17T17:35:28Z",
        "content": "Image copyrightEPA\r\nBoris Johnson says he is \"very confident\" MPs will back the Brexit deal he has struck with the EU - despite the DUP's opposition to it.\r\nThe prime minister claimed he would win what is expected to be a knife-edge Commons vote on Saturday.\r… [+2837 chars]"
    },
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "BBC News",
        "title": "Trump golf course to host next G7 summit",
        "description": "One of President Trump's golf resorts in Florida will host the G7 summit next June, White House announces",
        "url": "http://www.bbc.co.uk/news/world-us-canada-50087836",
        "urlToImage": "news5",
        "publishedAt": "2019-10-17T17:00:21Z",
        "content": "One of President Donald Trump's golf resorts in Florida will host the G7 summit next June, the White House has announced.\r\nWhite House chief of staff Mick Mulvaney told reporters that President Trump would not profit from the event.\r\nMr Mulvaney said \"Donald … [+867 chars]"
    },
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "BBC News",
        "title": "US soldier misidentified in Iwo Jima WW2 photo",
        "description": "The true identity of one of the troops shown planting the US flag in a famous WW2 photo is revealed.",
        "url": "http://www.bbc.co.uk/news/world-us-canada-50074221",
        "urlToImage": "news6",
        "publishedAt": "2019-10-17T16:38:49Z",
        "content": "Image copyrightGetty ImagesImage caption\r\n The image has been made into a statue at Arlington National Cemetery outside Washington DC\r\nOne of the troops photographed raising the US flag on the Pacific island of Iwo Jima in 1945 was misidentified, the US Marin… [+2860 chars]"
    },
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "BBC News",
        "title": "Veteran US Democrat Elijah Cummings dies at 68",
        "description": "The US congressman was heavily involved with the Trump impeachment inquiry.",
        "url": "http://www.bbc.co.uk/news/world-us-canada-50082551",
        "urlToImage": "news7",
        "publishedAt": "2019-10-17T16:25:32Z",
        "content": "Image copyrightReuters\r\nVeteran US Democratic congressman Elijah Cummings, who was heavily involved with the Trump impeachment inquiry, has died at the age of 68.\r\nHis office said he had died as a result of \"longstanding health challenges\".\r\nAs chairman of th… [+3877 chars]"
    },
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "BBC News",
        "title": "Mysterious brainless 'blob' that can learn and eat",
        "description": "A yellow organism, which looks like fungus but acts like an animal, has gone on display at a Paris zoo.",
        "url": "http://www.bbc.co.uk/news/science-environment-50081057",
        "urlToImage": "news8",
        "publishedAt": "2019-10-17T15:50:35Z",
        "content": "null"
    },
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "BBC News",
        "title": "US envoy 'disappointed' at Trump over Ukraine",
        "description": "US Ambassador to the EU Gordon Sondland is speaking to the congressional impeachment inquiry.",
        "url": "http://www.bbc.co.uk/news/world-us-canada-50087392",
        "urlToImage": "news9",
        "publishedAt": "2019-10-17T15:33:02Z",
        "content": "Image copyrightReutersImage caption\r\n Gordon Sondland was scheduled to appear before the impeachment inquiry committees on 8 October\r\nA top US envoy has told a congressional impeachment inquiry that he was \"disappointed\" in President Donald Trump over Ukraine… [+3517 chars]"
    }
]

